Ran Plan for dir: `infrastructure/gcp/cloud-deployment/gcloud-kms-ols` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.gcloud_kms.google_kms_crypto_key.cryptokey will be created
+ resource "google_kms_crypto_key" "cryptokey" {
      + destroy_scheduled_duration = "24"
      + id                         = (known after apply)
      + import_only                = (known after apply)
      + key_ring                   = (known after apply)
      + name                       = "ols-dev-gcloud-kms-cryptokey"
      + purpose                    = "ENCRYPT_DECRYPT"
      + rotation_period            = "2592000s"

      + version_template {
          + algorithm        = "GOOGLE_SYMMETRIC_ENCRYPTION"
          + protection_level = "SOFTWARE"
        }
    }

  # module.gcloud_kms.google_kms_crypto_key_iam_binding.cryptokey_iam_binding will be created
+ resource "google_kms_crypto_key_iam_binding" "cryptokey_iam_binding" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + members       = (known after apply)
      + role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.gcloud_kms.google_kms_key_ring.keyring will be created
+ resource "google_kms_key_ring" "keyring" {
      + id       = (known after apply)
      + location = "global"
      + name     = "ols-dev-gcloud-kms-keyring"
      + project  = (known after apply)
    }

  # module.gcloud_kms.google_service_account.service_account will be created
+ resource "google_service_account" "service_account" {
      + account_id   = "ols-dev-gcloud-kms-sa"
      + disabled     = false
      + display_name = "ols-dev-gcloud-kms-sa service account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ cryptokey_id          = (known after apply)
+ keyring_id            = (known after apply)
+ service_account_email = (known after apply)
+ service_account_id    = (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure/gcp/cloud-deployment/gcloud-kms-ols`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ols-dev-gce-atlantis:4141/lock?id=greyhats13%252Fol_shop%252Finfrastructure%252Fgcp%252Fcloud-deployment%252Fgcloud-kms-ols%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure/gcp/cloud-deployment/gcloud-kms-ols`
</details>
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`